Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВСпискеВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьСписокПользователейНаСервере()
	//Добавить обход существующих записей!!!
	СписокПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого ПользовательИБ Из СписокПользователейИБ Цикл
		Пользователь = Справочники.Пользователи.СоздатьЭлемент();
		Пользователь.Наименование = ПользовательИБ.Имя;
		Пользователь.ПолноеИмя = ПользовательИБ.ПолноеИмя;
		Пользователь.ПоказыватьВСпискеВыбора = ПользовательИБ.ПоказыватьВСпискеВыбора;
		Пользователь.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
		
		Пользователь.ОбменДанными.Загрузка = Истина;
		
		Пользователь.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан новый пользователь в справочнике: " + Пользователь.Наименование;
		Сообщение.Сообщить();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПользователей(Команда)
	Ответ = Вопрос("Вы уверены в обновлении списка? При выполнении команды будут добавлены пользователи независимо от данного списка. Есть риск создать дубликаты!"
	, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет, "Предупреждение");
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбновитьСписокПользователейНаСервере();
	КонецЕсли;
КонецПроцедуры
